Repository: b4oshany/rapido.plone
Catalog: docs/_locales/*/LC_MESSAGES/principles.po
Languages: es

source: Principles
es: Principios

source: Creating a Rapido app
es: Creación de una aplicación Rapido

source: Here are the basic steps to create a Rapido app:
es: Estos son los pasos básicos para crear una aplicación Rapido:

source: go to the theme folder (in Plone setup / Theme if we prefer to work inline, or, if your prefer to work in the filesystem, it might be either in the ``static`` folder in your theme package, or in the ``resources`` folder in your Plone install if you do not have a custom package),
es: vaya a la carpeta de temas (en Configuración del sitio / Tema si preferimos trabajar en línea o, si prefiere trabajar en el sistema de archivos, eso puede estar en la carpeta ``static`` paquete de tema o en la carpeta de ``resources`` de su instalación de Plone, si no tiene un paquete personalizado),

source: add a new folder named ``rapido``,
es: añadir una nueva carpeta llamada ``rapido``,

source: in ``rapido``, add a new folder named ``myapp``.
es: en la carpeta ``rapido``, agregue una nueva carpeta llamada ``myapp``.

source: That's it.
es: Eso es todo.

source: Now, we can implement our application in this folder. Here is a typical layout for a rapido app::
es: Ahora, podemos implementar nuestra aplicación en esta carpeta. Aquí está una estructura típica para una aplicación rapido::

source: ``settings.yaml`` is not mandatory, but it allows defining access rights if needed.
es: el archivo ``settings.yaml`` no es obligatorio, pero permite definir los derechos de acceso si es necesario.

source: A Rapido application can also be located in a non-active theme (see :doc:`./reference/application`)
es: Una aplicación Rapido también se puede ubicar en un tema no activo (ver :doc:`./reference/application`)

source: The app components are ``blocks``. A block is defined by a set of 3 files (HTML, Python, and YAML) located in the ``blocks`` folder.
es: Los componentes de la aplicación son ``blocks``. Un bloque se define por un conjunto de 3 archivos (HTML, Python y YAML) que se encuentran en la carpeta de ``blocks``.

source: The **YAML file** defines the elements. An element is any dynamically generated element in a block: it can be a form field (input, select, etc.), but also a button (``ACTION``), or even just a piece of generated HTML (``BASIC``).
es: El **archivo YAML** define los elementos. Un elemento es cualquier elemento generado dinámicamente en un bloque: puede ser un campo de formulario (input, select, etc.), pero también un botón (``ACTION``), o incluso un fragmento de HTML generado (``BASIC``).

source: The **HTML file** contains the layout of the block. The templating mechanism is super simple, elements are just enclosed in brackets, like this: ``{my_element}``.
es: El **archivo HTML** contiene el diseño del bloque. El mecanismo de plantilla es super simple, los elementos se adjuntan entre paréntesis, como esto: ``{my_element}``.

source: The **Python file** contains the application logic. It is a set of functions, each named for the element or the event it corresponds to.
es: El **archivo Python** contiene la lógica de la aplicación. Es un conjunto de funciones, cada una nombrada para el elemento o el evento al que corresponde.

source: For a ``BASIC`` element, for instance, we need to provide a function with the same name as the element; its return-value replaces the element in the block.
es: Para un elemento ``BASIC``, por ejemplo, necesitamos proporcionar una función con el mismo nombre que el elemento; Su valor de retorno reemplaza al elemento en el bloque.

source: For an ``ACTION``, we are supposed to provide a function with the same name as the element; in this case, it will be *executed* when a user clicks on the action button.
es: Para un elemento ``ACTION``, se supone que debemos proporcionar una función con el mismo nombre que el elemento; En este caso, se ejecutará cuando un usuario haga clic en el botón de acción.

source: Here is a basic example:
es: Aquí está un ejemplo básico:

source: We can see our block by visiting the following URL:
es: Podemos ver nuestro bloque, visitando la siguiente URL:

source: It works fine, but where is our Plone site now??
es: Funciona bien, pero ¿dónde está nuestro sitio de Plone ahora?

source: Inserting our block in a Plone page
es: Insertando nuestro bloque en una página Plone

source: To put our block somewhere in the Plone site, we use a Diazo rule:
es: Para poner nuestro bloque en algún lugar del sitio de Plone, usamos una regla de Diazo:

source: Now, if we visit any page of our site, we will see our block.
es: Ahora, si visitamos cualquier página de nuestro sitio, veremos nuestro bloque.

source: If we want to display it only in the _News_ folder, we would use ``css:if-content``:
es: Si queremos mostrarlo solo en la carpeta _News_, usaremos ``css:if-content``:

source: See the `Diazo <http://docs.diazo.org/en/latest/>`_ documentation for more details.
es: Consulte la documentación de `Diazo <http://docs.diazo.org/en/latest/>`_ para obtener más detalles.

source: But unfortunately, when we click on our "Do something" button, we are redirected to the original bare block.
es: Pero desafortunadamente, cuando hacemos clic en nuestro botón "Hacer algo", estamos redirigidos al bloque original.

source: To remain in the Plone page, we need to activate the ``ajax`` target in ``rapido/myapp/blocks/simpleblock.yaml``:
es: Para permanecer en la página de Plone, debemos activar el ``ajax`` destino en el archivo ``rapido/myapp/blocks/simpleblock.yaml``:

source: Now, when we click our button, the rapido block is reloaded inside the Plone page.
es: Ahora, cuando hacemos clic en nuestro botón, el bloque rapido se vuelve a cargar dentro de la página de Plone.

source: Instead of adding a block to an existing Plone view, we might need to provide a new rendering, mapped to a specific URL. We can do that by declaring our block as a Plone view in its YAML file:
es: En lugar de agregar un bloque a una vista Plone existente, es posible que tengamos que proporcionar una nueva representación, asignada a una URL específica. Podemos hacerlo declarando nuestro bloque como una vista de Plone en su archivo YAML:

source: And then we call ``@@my-custom-view`` on any content, like:
es: Y luego llamamos a ``@@my-custom-view`` en cualquier contenido, como:

source: We can create as many views as we might need (like ``@@subscribe``, ``@@unsubscribe``, ``@@stats``, ...).
es: Podemos crear tantas vistas como nosotros quizas necesitemos (como ``@@subscribe``, ``@@unsubscribe``, ``@@stats``, ...).

source: Adding a lot of rapido rules in our main ``rules.xml`` is not ideal.
es: Añadir un montón de reglas rapido en nuestro archivo ``rules.xml`` no es ideal.

source: We might prefer to create a ``rules.xml`` file in our ``rapido/myapp`` folder, and include it in our main ``rules.xml`` file like this:
es: Nosotros podríamos preferir crear un archivo ``rules.xml`` en nuestra carpeta ``rapido/myapp`` e incluirlo en nuestro archivo ``rules.xml`` como este:

source: Running Python code
es: Ejecución de código Python

source: Every function in our Python files takes a parameter named ``context``. The context gives access to useful objects:
es: Cada función en nuestros archivos de Python toma un parámetro llamado``context``. El contexto da acceso a objetos útiles:

source: ``context.app``: the current rapido app,
es: ``context.app``: la actual aplicación rapido,

source: ``context.block``: (if executed in a block context) the current block,
es: ``context.block``: (si se ejecuta en un contexto de bloque) el bloque actual,

source: ``context.record``: (if executed in a record context) the current record,
es: ``context.record``: (si se ejecuta en un contexto de registro) el registro actual,

source: ``context.request``: the current request to rapido (the sub-request, if called from Diazo),
es: ``context.request``: la petición actual a rapido (la sub-petición, si se llama de Diazo),

source: ``context.parent_request``: the current page request (when called from Diazo),
es: ``context.parent_request``: el request de la página actual (cuando se llama desde Diazo),

source: ``context.portal``: the Plone portal object,
es: ``context.portal``: el objeto de portal Plone,

source: ``context.content``: the current Plone content object,
es: ``context.content``: el actual objeto de contenido Plone,

source: ``context.api``: the `Plone API <http://docs.plone.org/external/plone.api/docs/>`_.
es: ``context.api``: la `API de Plone <http://docs.plone.org/external/plone.api/docs/>`_.

source: ``context`` is not the usual ``context`` we know in Plone (like ``context`` in a ZPT template or a PythonScript, or ``self.context`` in a BrowserView).
es: ``context`` no es el ``context`` habitual que conocemos en Plone (como ``context`` en una plantilla ZPT o un PythonScript, o ``self.context`` en un BrowserView).

source: The Plone ``context`` is usually the current content. In Rapido we can obtain it using ``context.content``.
es: El ``context`` Plone suele ser el contenido actual. En Rapido podemos obtenerlo usando ``context.content``.

source: This allows us to interact with Plone in many ways, for instance we can run catalog queries, create contents, change workflow status, etc.
es: Esto nos permite interactuar con Plone de muchas maneras, por ejemplo, podemos ejecutar consultas de catálogo, crear contenidos, cambiar el estado del flujo de trabajo, etc.

source: Nevertheless, it will behave as expected:
es: Sin embargo, se comportará como se esperaba:

source: the code will always be executed with the current user's access right, so the appropriate Plone access restrictions will be applied,
es: el código siempre se ejecutará con el actual derecho de acceso del usuario, por lo que se aplicarán las restricciones de acceso correspondientes de Plone,

source: the CSRF policy will also be applied (for instance, a Plone operation marked as ``PostOnly`` would fail if performed in a GET request).
es: la política CSRF también se aplicará (por ejemplo, una operación Plone marcada como ``PostOnly`` fallaría si se realiza en una solicitud GET).

source: The code we put in our Python files is compiled and executed in a sandboxed environment (provided by `zope.untrustedpython.interpreter <https://github.com/zopefoundation/zope.untrustedpython/blob/master/docs/narr.rst>`_).
es: El código que ponemos en nuestros archivos de Python se compila y ejecuta en un entorno de espacio aislado (proporcionado por `zope.untrustedpython.interpreter <https://github.com/zopefoundation/zope.untrustedpython/blob/master/docs/narr.rst>`_).

source: To help us debugging our code, we can add:
es: Para ayudarnos a depurar nuestro código, podemos agregar:

source: in our app ``settings.yaml`` file. Then we can add some log message in our code:
es: en nuestro archivo ``settings.yaml`` de aplicación. Entonces podemos agregar algún mensaje de registro en nuestro código:

source: and they will be display in both the server log and the browser's javascript console.
es: y se mostrarán tanto en el registro del servidor como en la consola javascript del navegador.

source: Storing and retrieving data
es: Almacenando y recuperando datos

source: A rapido app provides a builtin storage service, based on `Souper <https://pypi.python.org/pypi/souper>`_.
es: Una aplicación rapido proporciona un servicio de almacenamiento integrado, basado en `Souper <https://pypi.python.org/pypi/souper>`_.

source: Souper is designed to store (and index) huge amounts of small data (it can easily store survey results, comments, ratings, etc., but it will not be appropriate for attached files for instance).
es: Souper está diseñado para almacenar (e indexar) enormes cantidades de datos pequeños (puede almacenar fácilmente los resultados de la encuesta, comentarios, clasificaciones, etc., pero no será apropiado para los archivos adjuntos, por ejemplo).

source: The Rapido storage service stores **records**, and records contain **items**.
es: El servicio de almacenamiento Rapido almacena **registros** y los registros contienen **elementos**.

source: There are 3 ways to create records in Rapido:
es: Hay 3 maneras de crear registros en Rapido:

source: we can create records by submitting a block: if a block contain some fields elements (like ``TEXT`` or ``NUMBER`` elements for instance), and if the block contains a *save* button (by adding ``{_save}`` in its layout), every time the user enters values in the fields and clicks save, the submitted values will be saved in a new record,
es: podemos crear registros enviando un bloque: si un bloque contiene algunos elementos de campos (como elementos ``TEXT`` o ``NUMBER`` por ejemplo), y si el bloque contiene un botón de guardar (agregando ``{_save}`` en su diseño), cada vez que el usuario ingrese valores en los campos y haga clic en guardar, los valores enviados se guardarán en un nuevo registro,

source: we can create records by code::
es: podemos crear registros por código::

source: we can create records using the Rapido JSON REST API::
es: podemos crear registros utilizando el API REST JSON de Rapido::

source: or::
es: o::

source: The same goes for accessing data:
es: Lo mismo ocurre con el acceso a los datos:

source: we can display records by calling their URL, and they will be rendered using the block they were created with::
es: podemos mostrar registros llamando a su dirección URL, y se renderizarán usando el bloque con el que fueron creados::

source: we can get a record by code:
es: podemos obtener un registro por código:

source: we can get records using the Rapido JSON REST API::
es: podemos obtener registros utilizando el API REST JSON de Rapido::

source: Integration with Plone
es: Integración con Plone

source: In addition to the Diazo injection of Rapido blocks in our theme, we can also integrate our Rapido developments in Plone using:
es: Además de la inserción de bloques Rapido usando Diazo en nuestro tema, también podemos integrar nuestros desarrollos Rapido en Plone utilizando:

source: Mosaic: Rapido provides a Mosaic tile which enables us to insert a Rapido block in our page layout.
es: Mosaico: Rapido proporciona un tile para Mosaic que nos permite insertar un bloque Rapido en nuestro diseño de página.

source: Content Rules: Rapido provides a Plone *content rule action* allowing us to call a Python function from a block when a given Plone event happens.
es: Reglas de contenido: Rapido proporciona una acción de regla de contenido de Plone que nos permite llamar a una función de Python de un bloque cuando ocurre un evento de Plone dado.

source: `Mockup <http://plone.github.io/mockup/dev/>`_ patterns: the *modal* and the *content loader* patterns can load and display Rapido blocks.
es: Patrones de `Mockup <http://plone.github.io/mockup/dev/>`_: los patrones de *modal* y *loader de contenido* pueden cargar y mostrar bloques Rapido.

source: See :doc:`reference/display`.
es: Ver :doc:`reference/display`.
