Repository: b4oshany/rapido.plone
Catalog: docs/_locales/*/LC_MESSAGES/python-api.po
Languages: es

source: Python API
es: API de Python

source: Any Rapido Python function receives ``context`` as parameter.
es: Cualquier función Python de Rapido recibe el ``context`` como parámetro.

source: The ``context`` provides the following properties:
es: El ``context`` proporciona las siguientes propiedades:

source: This property gives access to the Rapido application object.
es: Esta propiedad da acceso al objeto de aplicación Rapido.

source: *Properties*
es: *Propiedades*

source: Returns the Rapido application's access control list object (see below).
es: Devuelve el objeto de la lista de control de acceso de la aplicación Rapido (ver abajo).

source: Returns the existing block ids.
es: Devuelve los identificadores de bloque existentes.

source: Returns the existing index ids.
es: Devuelve los identificadores de índice existentes.

source: Returns the application URL.
es: Devuelve la URL de la aplicación.

source: *Methods*
es: *Métodos*

source: Creates and return a new record. If ``id`` is not provided, a default one is generated. If ``id`` already exists, it is replaced with another one (like ``...-1``, ``...-2``).
es: Crea y devuelve un nuevo registro. Si no se proporciona ``id``, se genera una predeterminada. Si ``id`` ya existe, se sustituye por otro (como ``...-1``, ``...-2``).

source: Delete the record (which can be passed as object or id). If ``ondelete`` is truthy, the ``on_delete`` function will be called (if it exists) before deleting the record.
es: Elimine el registro (que se puede pasar como objeto o como id). Si la ``ondelete`` es verdad, la función ``on_delete`` será llamada (si existe) antes de borrar el registro.

source: Returns a block.
es: Devuelve un bloque.

source: Returns the record corresponding to the ``id``, or ``None`` if it does not exist.
es: Devuelve el registro correspondiente al ``id``, o ``None`` si no existe.

source: Logs a message in the server log. If the app is in *debug* mode, logs the same message in the browser's javascript console. Messages can be strings or any other serializable object.
es: Registra un mensaje en el registro del servidor. Si la aplicación está en modo de depuración, registra el mismo mensaje en la consola javascript del navegador. Los mensajes pueden ser cadenas o cualquier otro objeto serializable.

source: Returns all the records as a list.
es: Devuelve todos los registros como una lista.

source: Returns all the records as a Python generator.
es: Devuelve todos los registros como un generador de Python.

source: Performs a search and returns records as a list.
es: Realiza una búsqueda y devuelve registros como una lista.

source: Performs a search and returns records as a Python generator.
es: Realiza una búsqueda y devuelve registros como un generador de Python.

source: ``context.request`` is the actual request to Rapido, like:
es: ``context.request`` es la actual request a Rapido, como:

source: When a block is embedded in a Plone page, ``context.request`` was issued by the user's browser, it was issued by Diazo.
es: Cuando un bloque está embebido en una página de Plone, ``context.request`` fue emitido por el navegador del usuario, fue emitido por Diazo.

source: To get the request issued by the user's browser, we use ``context.parent_request``.
es: Para obtener el request emitida por el navegador del usuario, nosotros usamos ``context.parent_request``.

source: Both of them are HTTP requests objects, see the `reference documentation <http://docs.plone.org/develop/plone/serving/http_request_and_response.html>`_.
es: Ambos son objetos de solicitud HTTP, consulte la `documentación de referencia <http://docs.plone.org/develop/plone/serving/http_request_and_response.html>`_.

source: Examples:
es: Ejemplos:

source: Reading submitted values:
es: Lectura de valores presentados:

source: Reading the ``BODY``:
es: Lectura del ``BODY``:

source: Return the Plone portal object.
es: Devolver el objeto de portal Plone.

source: It is equivalent to:
es: Es equivalente a:

source: The most common task we will perform through the portal object is to get its contents:
es: La tarea más común que realizaremos a través del objeto de portal es obtener su contenido:

source: It returns the current Plone content.
es: Devuelve el contenido actual de Plone.

source: The most common tasks we will perform on the content are:
es: Las tareas más comunes que realizaremos en el contenido son:

source: reading/writing its attributes (read/write):
es: leer / escribir sus atributos (lectura / escritura):

source: getting its URL:
es: obteniendo su URL:

source: To manipulate the content, refer to the `Plone API documentation about contents <http://docs.plone.org/develop/plone.api/docs/content.html>`_.
es: Para manipular el contenido, consulte la `documentación de la API de Plone sobre el contenido <http://docs.plone.org/develop/plone.api/docs/content.html>`_.

source: Depending on its content type, the content object might have very different methods and properties.
es: Dependiendo de su tipo de contenido, el objeto de contenido puede tener métodos y propiedades muy diferentes.

source: It returns the current Rapido record if any.
es: Devuelve el registro Rapido actual si lo hay.

source: See `Record`_ for more information.
es: Consulte `Registro`_ para obtener más información.

source: It gives access to the full `Plone API <http://docs.plone.org/develop/plone.api/docs/index.html>`_.
es: Da acceso completo a la `API de Plone <http://docs.plone.org/develop/plone.api/docs/index.html>`_.

source: There is no need to import the API, as shown in all the Plone API examples:
es: No es necesario importar la API, como se muestra en todos los ejemplos de API de Plone:

source: because the API is already available in the Rapido `context`:
es: porque la API ya está disponible en el `context` de Rapido:

source: This API mainly allows:
es: Esta API permite principalmente:

source: to search contents; for example:
es: buscar contenidos; por ejemplo:

source: to manipulate contents (create / delete / move / publish / etc.), example:
es: para manipular contenidos (create / delete / move / publish / etc), ejemplo:

source: to access or manage the users and groups information, and send emails. Example:
es: para acceder o gestionar la información de usuarios y grupos y enviar correos electrónicos. Ejemplo:

source: For more detailed examples, refer to the `Plone API documentation <http://docs.plone.org/develop/plone.api/docs/index.html>`_.
es: Para ejemplos más detallados , consulte la `documentación de la API de Plone <http://docs.plone.org/develop/plone.api/docs/index.html>`_.

source: ``context.rapido`` is a function able to obtain another Rapido application in our current script.
es: ``context.rapido`` es una función capaz de obtener otra aplicación Rapido en nuestro script actual.

source: It takes as mandatory parameter the id of the Rapido application. Example:
es: Toma como parámetro obligatorio el id de la aplicación Rapido. Ejemplo:

source: It might also accept a ``content`` parameter to provide a specific content context to the app (if not provided, it will take the current content). Example:
es: También puede aceptar un parámetro ``content`` para proporcionar un específico contexto contenido a la aplicación (si no se proporciona, se tomará el contenido actual). Ejemplo:

source: For security reason, it is not allowed to import a Python module in a Rapido Python file.
es: Por razones de seguridad, no se permite importar un módulo Python en un archivo Rapido Python.

source: Rapido provides some safe modules through ``context.modules``:
es: Rapido proporciona algunos módulos seguros a través de ``context.modules``:

source: ``context.modules.datetime``: `Basic date and time types <https://docs.python.org/2/library/datetime.html>`_,
es: ``context.modules.datetime``: `Tipos básicos de fecha y hora <https://docs.python.org/2/library/datetime.html>`_,

source: ``context.modules.random``: `Generate pseudo-random numbers <https://docs.python.org/2/library/random.html>`_,
es: ``context.modules.random``: `Genera números pseudo-aleatorios <https://docs.python.org/2/library/random.html>`_,

source: ``context.modules.time``: `Time access and conversions <https://docs.python.org/2/library/time.html>`_.
es: ``context.modules.time``: `Tiempo de acceso y conversiones <https://docs.python.org/2/library/time.html>`_.

source: If we need to add extra modules to ``context.modules``, we can do it by adding in our own add-on something like:
es: Si necesitamos agregar módulos a ``context.modules``, podemos hacerlo agregando en nuestro propio complemento de la siguiente forma:

source: In this example, we allow to access ``context.modules.re`` from our Rapido Python files.
es: En este ejemplo, permitimos acceder a ``context.modules.re`` desde nuestros archivos Python Rapido.

source: Record
es: Registro

source: Returns the record URL.
es: Devuelve la URL del registro.

source: Returns the record identifier.
es: Devuelve el identificador de registro.

source: Render the record using its associated block (if any).
es: Representa el registro utilizando su bloque asociado (si existe).

source: Returns the value of the item (and defaults to ``default`` if the item does not exist).
es: Devuelve el valor del elemento (y el valor predeterminado es el ``default`` si el elemento no existe).

source: Returns all the stored items.
es: Devuelve todos los elementos almacenados.

source: Re-index the record.
es: Vuelva a indexar el registro.

source: Update the record with the provided items and index it.
es: Actualizar el registro con los elementos proporcionados e indexarlo.

source: ``request`` can be an actual HTTP request or a dictionnary.
es: ``request`` puede ser una request actual HTTP o un diccionario.

source: If a block is mentionned, formulas (``on_save``, computed elements, etc.) will be executed.
es: Si se menciona un bloque, se ejecutarán fórmulas (``on_save``, elementos calculados, etc.).

source: If no block (and ``request`` is a dict), we just save the items values.
es: Si no hay bloque (y ``request`` es un diccionario), solo salvamos los valores de los elementos.

source: Assign a block to the record. The block will be then used to render the record or to save it.
es: Asigne un bloque al registro. El bloque se utilizará entonces para representar el registro o para guardarlo.

source: *Python dictionary-like interface*
es: *Interfaz de diccionario de Python*

source: The record's items can be accessed and manipulated like dictionary items:
es: Los elementos del registro se pueden acceder y manipular como elementos del diccionario:

source: When setting an item value, the record is not reindexed.
es: Cuando se establece un valor de elemento, el registro no se reindexa.

source: Access control list
es: Lista de control de acceso

source: The application access control list can be obtain by ``context.app.acl``.
es: La lista de control de acceso a la aplicación puede ser obtenida mediante ``context.app.acl``.

source: **Methods**
es: **Métodos**

source: Returns the current user id. Equivalent to:
es: Devuelve el ID de usuario actual. Equivalente a:

source: Returns the groups the current user belongs to. Equivalent to:
es: Devuelve los grupos al usuario actual al que pertenece. Equivalente a:

source: Returns ``True`` if the current user has the specified access right (Rapido access rights are ``reader``, ``author``, ``editor``, ``manager``)
es: Devuelve ``True`` si el usuario actual tiene el derecho de acceso especificado (los derechos de acceso Rapido son ``reader``, ``author``, ``editor``, ``manager``)

source: Returns ``True`` if the current user has the specified role.
es: Devuelve ``True`` si el usuario actual tiene la función especificada.

source: Returns the existing roles.
es: Devuelve los roles existentes.
