Repository: b4oshany/rapido.plone
Catalog: docs/_locales/*/LC_MESSAGES/rest.po
Languages: es

source: REST API
es: API REST

source: Get the application settings
es: Obtén las configuraciones de la aplicación

source: **HTTP Response Headers** ::
es: **Cabecera Response HTTP** ::

source: Returns the Rapido application settings and sets a token in the ``X-CSRF-TOKEN`` HTTP header value.
es: Devuelve la configuración de la aplicación Rapido y establece un token en el valor del encabezado HTTP ``X-CSRF-TOKEN``.

source: This HTTP header will have to be reused in all the requests made to the API (except for GET requests).
es: Esta cabecera HTTP tendrá que ser reutilizada en todas las solicitudes hechas a la API (excepto para las solicitudes GET).

source: Authentication
es: Autenticación

source: Some of the operations below require authentication before they will run successfully. You will need to generate an Authorization String (A Base64 encoded version of your username and password separated by a dot).
es: Algunas de las operaciones siguientes requieren autenticación antes de que se ejecuten correctamente. Tendrá que generar una cadena de autorización (una versión codificada Base64 de su nombre de usuario y contraseña separados por un punto).

source: Basic Authorization String
es: Cadena Básica de Autenticación

source: If your username is "john" and your password is "password", you can quickly generate the basic authorization string on the python prompt as follows::
es: Si su nombre de usuario es "john" y su contraseña es "password", puede generar rápidamente la cadena de autorización básica en el indicador python de la siguiente manera::

source: Now you can use this header in all your requests::
es: Ahora usted usa esta cabecera en todos sus requests::

source: The expected X-CSRF-TOKEN will be change when you use a Basic Authorization header.
es: El X-CSRF-TOKEN esperado cambiará cuando utilice un encabezado de autorización básica.

source: Compute an element
es: Calcular un elemento

source: or::
es: o::

source: Returns the value returned by the element computation. The X-CSRF-TOKEN is not needed for a GET if the computation does not produce any change.
es: Devuelve el valor devuelto por el cálculo del elemento. El X-CSRF-TOKEN no es necesario para un GET si el cálculo no produce ningún cambio.

source: Get a record
es: Obtener un registro

source: Returns the record items.
es: Devuelve los elementos registro.

source: Get all the records
es: Obtiene todos los registros

source: Returns all the records.
es: Devuelve todos los registros.

source: Create a new record
es: Crear un nuevo registro

source: Creates a new record with the provided items.
es: Crear un nuevo registro con los elementos proveídos.

source: Create many records
es: Crear muchos registros

source: Bulk creation of records.
es: Creación masiva de registros.

source: Create a new record by id
es: Crear un nuevo registro por id

source: Creates a new record with the provided items and having the specified id.
es: Crear un nuevo registro con los elementos proveídos y teniendo el id especifico.

source: Delete a record
es: Elimina un registro

source: Deletes the record.
es: Elimina el registro.

source: Remove all records
es: Remueve todos los registros

source: Remove all the records and delete the indexes.
es: Remueve todos los registros y elimina los índices.

source: Update a record
es: Actualiza un registro

source: Updates the record with provided items.
es: Actualiza el registro con los elementos proveídos.

source: Search for records
es: Búsqueda de registros

source: Search for records.
es: Búsqueda de registros.

source: Re-index
es: Reíndice

source: Re-declare the indexes and re-index all the records.
es: Vuelve a declarar los índices y vuelve a indexar todos los registros.
