Repository: b4oshany/rapido.plone
Catalog: docs/_locales/*/LC_MESSAGES/use-cases.po
Languages: es

source: Use *Rapido* to create custom *SearchableText* field
es: Utilice *Rapido* para crear un campo personalizado de *SearchableText*

source: Objective
es: Objetivo

source: Create TTW (Through The Web) a *Book* content type where fields are indexed for a full-text search.
es: Crear TTW (a través de la Web) a Tipo de contenido del *Book* donde los campos están indexados para una búsqueda de texto completo.

source: Content type
es: Tipo de contenido

source: Add a new content type *Book* on the *Dexterity Content Types* control panel (http://localhost:8080/Plone/@@dexterity-types).
es: Agregue un nuevo tipo de contenido *Book* en el panel de control *Tipos de contenido Dexterity* (http://localhost:8080/Plone/@@dexterity-types).

source: Edit the *Book* configuration (http://localhost:8080/Plone/dexterity-types/book). In the *Behaviors* tab, uncheck the *Dublin Core metadata* behavior and *Save*. In the *Fields* tab, click on the *Edit XML Field Model* button and replace the XML model by:
es: Edite la configuración de *Book* (http://localhost:8080/Plone/dexterity-types/book). En la pestaña *Comportamientos*, desmarque el comportamiento de los *Metadatos de Dublin Core* y *Guardar*. En la ficha *Campos*, haga clic en el botón *Editar modelo de campo XML* y reemplace el modelo XML por el siguiente:

source: You can now add *Book* content in your web site (http://localhost:8080/Plone/++add++book).
es: Ahora puede agregar contenido de *Book* en su sitio web (http://localhost:8080/Plone/++add++book).

source: Full text search field
es: Campo de búsqueda de texto completo

source: If you have a lot of books in your site, you would like to search on the author's name or the back cover content. To do this we have to provide a ``SearchableText`` method or field which give the content of the full-text index. We'll use a *rapido block* and a *rapido content rule action* to compute this ``SearchableText`` field.
es: Si tiene un montón de libros en su sitio, le gustaría buscar en el nombre del autor o el contenido de la portada. Para ello, debemos proveer un método o campo ``SearchableText`` el cual le de el contenido del índice de texto completo. Nosotros usaremos un *bloque rapido* y una *acción de regla de contenido disponible en el paquete rapido* para calcular este campo ``SearchableText``.

source: Rapido block
es: Bloque Rapido

source: Go to the *Theming* control panel (http://localhost:8080/Plone/@@theming-controlpanel). Create a new theme *MyTheme* with this structure.
es: Vaya al panel de control Tema (http://localhost:8080/Plone/@@theming-controlpanel). Crea un nuevo tema llamado *MyTheme* con esta estructura siguiente.

source: Look for example at the `Inheriting a new theme from Barceloneta <http://docs.plone.org/adapt-and-extend/theming/barceloneta.html#inheriting-a-new-theme-from-barceloneta>`_ section of the Plone documentation for the content of ``index.html``, ``manifest.cfg`` and ``rules.xml`` files.
es: Busque, por ejemplo, en la sección `Inheriting a new theme from Barceloneta <http://docs.plone.org/adapt-and-extend/theming/barceloneta.html#inheriting-a-new-theme-from-barceloneta>`_ de la documentación de Plone para obtener contenido de archivos ``index.html``, ``manifest.cfg`` y ``rules.xml``.

source: Content of ``fields.py`` file:
es: Contenido del archivo ``fields.py``:

source: We use the ``portal_transforms`` tool to convert the ``back_cover`` HTML field to plain text. We also need to reindex the content.
es: Usaremos la herramienta ``portal_transforms`` para convertir el campo HTML ``back_cover`` en texto plano. También necesitamos reindexar el contenido.

source: Rapido content rule action
es: Acción de regla de contenido Rapido

source: The last thing we need is a *rapido content rule action* which is used on each book modification.
es: Lo último que necesitamos es una *acción de regla de contenido rapido* que se usa en cada modificación del libro.

source: Go to the *Content Rules* (http://localhost:8080/Plone/@@rules-controlpanel) and add a rule which is triggered on *Object modified* event.
es: Vaya a las *Reglas de contenido* (http://localhost:8080/Plone/@@rules-controlpanel) y agregue una regla que se activa en el evento *Objeto modificado*.

source: Add a *Content type* condition on *Book*. Add a *Rapido action*.
es: Agregue una condición de *Tipo de contenido* en *Book*. Añade una *acción de Rapido*.

source: Assign the content rule on the whole site and *Save*.
es: Asigne la regla de contenido en todo el sitio y *Guardar*.

source: Exercise
es: Ejercicio

source: Modify the code above to compute a *Description* field which will be used in Plone listings.
es: Modifique el código anterior para calcular un campo *Descripción* que se utilizará en los listados de Plone

source: Custom book view
es: Vista personalizada de Book

source: To build a custom book view, the simplest solution is to use a *Diazo* rule.
es: Para crear una vista del tipo de contenido book personalizada, la solución más simple es utilizar una regla de *Diazo*.

source: For example, you can add in the ``rules.xml`` file of your theme the following ``diazo rule``:
es: Por ejemplo, puede agregar en el archivo ``rules.xml`` de su tema la siguiente ``regla diazo``:

source: Our new custom book views:
es: Nuestras nuevas vistas de libros personalizadas:

source: Glossary use case
es: Caso de uso del glosario

source: We want to provide a tool to manage a list of terms and their definitions:
es: Queremos proporcionar una herramienta para administrar una lista de términos y sus definiciones:

source: Every time one of these terms appears on a page of our site, it will be wrapped into a `<abbr>` tag, the title of which will be the definition, so when we hover a term, we get a small popup indicating its definition:
es: Cada vez que uno de estos términos aparezca en una página de nuestro sitio, será envuelto en una etiqueta `<abbr>`, cuyo título será la definición, por lo que cuando pasamos un término, obtenemos un pequeña mensaje emergente que indica su definición:

source: Application structure
es: Estructura de la aplicación

source: Rules.xml
es: El archivo rules.xml

source: This rule inserts in all our pages a javascript file in charge of replacing matching words with ``<abbr>`` tags.
es: Esta regla inserta en todas nuestras páginas un archivo javascript a cargo de reemplazar las palabras coincidentes con etiquetas ``<abbr>``.

source: The ``term`` block
es: El bloque ``term``

source: This block is a form allowing to create/edit/delete a glossary term. It contains two field elements and three actions.
es: Este bloque es un formulario que permite crear/editar/eliminar un término del glosario. Contiene dos elementos de campo y tres acciones.

source: If we click on any action in this block, we want to be redirected to the main management page. We do that by returning the ``all`` block URL (when an action returns a string, it is used as a redirection URL).
es: Si hacemos clic en cualquier acción en este bloque, queremos ser redirigidos a la página de administración principal. Lo hacemos devolviendo la URL de ``all`` bloques (cuando una acción devuelve una cadena, se utiliza como una dirección URL de redirección).

source: The ``all`` block
es: El bloque ``all``

source: This block lists all the existing terms in a table. When we click on a term, we open it in the ``term`` block in edit mode, and a button allows opening a blank ``term`` block to create a new term.
es: Este bloque lista todos los términos existentes en una tabla. Cuando hacemos clic en un término, lo abrimos en el bloque ``term`` en modo de edición, y un botón permite abrir un bloque ``term`` en blanco para crear un nuevo término.

source: The ``view`` setting allows to render the ``all`` block as Plone view named ``@@glossary``, so we can call http://localhost:8080/Plone/@@glossary to see it.
es: La configuración ``view`` permite renderizar el bloque ``all`` como la vista de Plone llamada ``@@glossary``, por lo que podemos llamar a http://localhost:8080/Plone/@@glossary para verlo.

source: The ``list`` function builds a table row for each existing record, displaying the *term* value and the *definition* value. The link we put on the term targets the record URL (plus `/edit` to open it in edit mode) and we have added `target="ajax"` so the resulting page is not displayed as a full page, it is just loaded into the current block in AJAX mode.
es: La función ``list`` crea una fila de tabla para cada registro existente, mostrando el valor del término y el valor de la *definición*. El enlace que ponemos en el término se dirige a la URL de registro (más `/edit` para abrirlo en modo de edición) y hemos añadido `target="ajax"` por lo que la página resultante no se muestra como una página completa, se acaba de cargar en la actual bloque en modo AJAX.

source: The Javascript
es: El Javascript

source: First thing we do is to check if we are in edit mode, and if we are, we stop, as we do not want to manipulate the HTML currently being edited in TinyMCE or in any input field.
es: Lo primero que hacemos es comprobar si estamos en modo de edición, y si lo estamos, nos detendremos, ya que no queremos manipular el HTML que está siendo editado en TinyMCE o en cualquier campo de entrada.

source: Then we load the glossary terms with the following JSON call: ``/tutorial/@@rapido/glossary/records``
es: Luego cargamos los términos del glosario con la siguiente llamada JSON: ``/tutorial/@@rapido/glossary/records``

source: Using the term values we have loaded, we build a regular expression able to match those terms in any text.
es: Usando el término valores que hemos cargado, construimos una expresión regular capaz de emparejar esos términos en cualquier texto.

source: Then we iterate on the page main content (``#content-core``) elements, and every time we find a text node, we use our regular expression to replace the matching words with an ``<abbr>`` tag where the ``title`` attribute is the associated definition.
es: Luego iteramos en los elementos principales del contenido de la página (``#content-core``), y cada vez que encontramos un nodo de texto, usamos nuestra expresión regular para reemplazar las palabras coincidentes con una etiqueta ``<abbr>`` donde el atributo ``title`` es la definición asociada.

source: Use cases
es: Casos de uso
